app/controllers/produtos_controller.rb

	def create
		valores = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade)
		@produto = Produto.new valores
		if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Mouse"], ["descricao", "ergomomico"], ["preco", 60.0], ["quantidade", 10], ["created_at", "2020-04-21 02:46:21.241340"], ["updated_at", "2020-04-21 02:46:21.241340"]]

	def destroy
		id = params[:id]
		Produto.destroy id
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 18]]