app/controllers/produtos_controller.rb

	def index
		@produtos = Produto.order(nome: :asc).limit 10
		@produto_com_desconto = Produto.order(:preco).limit 1
---
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC LIMIT ?  [["LIMIT", 2]]
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]

	def new
		@produto = Produto.new
		@departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"

    def edit
       id = params[:id]
       @produto = Produto.find(id)
       @departamentos = Departamento.all
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
SELECT "departamentos".* FROM "departamentos"

    def update
        id = params[:id]
        @produto = Produto.find(id)
        valores = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade, :departamento_id)
        if @produto.update valores
            flash[:notice] = "Produto atulalizado com sucesso!"
            redirect_to root_url
        else
            @departamentos = Departamento.all
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "produtos" SET "nome" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["nome", "Led Azul"], ["updated_at", "2020-05-30 01:37:07.828347"], ["id", 27]]
SELECT "departamentos".* FROM "departamentos"

	def create
		valores = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade, :departamento_id)
		@produto = Produto.new valores
		if @produto.save
---
INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at", "departamento_id") VALUES (?, ?, ?, ?, ?, ?, ?)

	def destroy
		id = params[:id]
		Produto.destroy id
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 26]]

	def busca
		@nome = params[:nome]
		@produtos = Produto.where "nome like ?", "%#{@nome}%"
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%nome%')